docs/misc/lis_request_soap_components

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing">
	<s:Header>
		<a:Action s:mustUnderstand="1">http://tempuri.org/IEmrService/EMRQueryReportRecord</a:Action>
		<a:MessageID>urn:uuid:713986fa-2887-494b-a008-6d696ad019d1</a:MessageID>
		<a:ReplyTo>
			<a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
		</a:ReplyTo>
		<a:To s:mustUnderstand="1">http://hisweb.hosp.ncku/HISService/OPD/nckuHisWeb/EmrService.svc</a:To>
	</s:Header>
	<s:Body>
		<EMRQueryReportRecord xmlns="http://tempuri.org/">
			<ChartNO>
				<xs:schema id="NewDataSet" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns="" xmlns:msdata="urn:schemas-microsoft-com:xml-msdata">
					<xs:element name="NewDataSet" msdata:IsDataSet="true" msdata:UseCurrentLocale="true">
						<xs:complexType>
							<xs:choice minOccurs="0" maxOccurs="unbounded">
								<xs:element name="Table1">
									<xs:complexType>
										<xs:sequence>
											<xs:element name="source" type="xs:string" minOccurs="0"/>
											<xs:element name="source1" type="xs:string" minOccurs="0"/>
											<xs:element name="source2" type="xs:string" minOccurs="0"/>
											<xs:element name="source3" type="xs:string" minOccurs="0"/>
											<xs:element name="Chart_No" type="xs:string" minOccurs="0"/>
											<xs:element name="dept_Code" type="xs:string" minOccurs="0"/>
											<xs:element name="start_time" type="xs:string" minOccurs="0"/>
											<xs:element name="end_time" type="xs:string" minOccurs="0"/>
											<xs:element name="Doctor_Code" type="xs:string" minOccurs="0"/>
											<xs:element name="specimen_Id" type="xs:string" minOccurs="0"/>
											<xs:element name="Body_Site_Code" type="xs:string" minOccurs="0"/>
											<xs:element name="request_no" type="xs:string" minOccurs="0"/>
											<xs:element name="report_class" type="xs:string" minOccurs="0"/>
										</xs:sequence>
									</xs:complexType>
								</xs:element>
								<xs:element name="EMR_Query_Log">
									<xs:complexType>
										<xs:sequence>
											<xs:element name="Query_Time" type="xs:string"/>
											<xs:element name="Employee_Code" type="xs:string" minOccurs="0"/>
											<xs:element name="Employee_Name" type="xs:string" minOccurs="0"/>
											<xs:element name="Query_Item_Id" type="xs:string" minOccurs="0"/>
											<xs:element name="Login_System_Id" type="xs:string" minOccurs="0"/>
											<xs:element name="Query_Content" type="xs:string" minOccurs="0"/>
											<xs:element name="Action_Type" type="xs:string" minOccurs="0"/>
											<xs:element name="Output_Count" type="xs:string" minOccurs="0"/>
											<xs:element name="Output_Device" type="xs:string" minOccurs="0"/>
										</xs:sequence>
									</xs:complexType>
								</xs:element>
							</xs:choice>
						</xs:complexType>
						<xs:unique name="Constraint1" msdata:PrimaryKey="true">
							<xs:selector xpath=".//EMR_Query_Log"/>
							<xs:field xpath="Query_Time"/>
						</xs:unique>
					</xs:element>
				</xs:schema>
				<diffgr:diffgram xmlns:diffgr="urn:schemas-microsoft-com:xml-diffgram-v1" xmlns:msdata="urn:schemas-microsoft-com:xml-msdata">
					<NewDataSet xmlns="">
						<Table1 diffgr:id="Table11" msdata:rowOrder="0" diffgr:hasChanges="inserted">
							<source/>
							<Chart_No>pid</Chart_No>
							<dept_Code>0000</dept_Code>
							<start_time>start</start_time>
							<end_time>end</end_time>
							<Doctor_Code/>
							<specimen_Id/>
							<Body_Site_Code/>
							<report_class/>
						</Table1>
					</NewDataSet>
				</diffgr:diffgram>
			</ChartNO>
		</EMRQueryReportRecord>
	</s:Body>
</s:Envelope>

==============================

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing">
	<s:Header>
		<a:Action s:mustUnderstand="1">http://tempuri.org/IEmrService/EMRGetExamineReport</a:Action>
		<a:MessageID>urn:uuid:1c90d277-c568-4e8a-a265-4d4556038660</a:MessageID>
		<a:ReplyTo>
			<a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
		</a:ReplyTo>
		<a:To s:mustUnderstand="1">http://hisweb.hosp.ncku/HISService/OPD/nckuHisWeb/EmrService.svc</a:To>
	</s:Header>
	<s:Body>
		<EMRGetExamineReport xmlns="http://tempuri.org/">
			<requestNo xmlns:b="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
				<b:string>serialno</b:string>
			</requestNo>
			<Chart_No>pid</Chart_No>
			<ds>
				<xs:schema id="NewDataSet" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns="" xmlns:msdata="urn:schemas-microsoft-com:xml-msdata">
					<xs:element name="NewDataSet" msdata:IsDataSet="true" msdata:UseCurrentLocale="true">
						<xs:complexType>
							<xs:choice minOccurs="0" maxOccurs="unbounded">
								<xs:element name="EMR_Query_Log">
									<xs:complexType>
										<xs:sequence>
											<xs:element name="Query_Time" type="xs:string"/>
											<xs:element name="Employee_Code" type="xs:string" minOccurs="0"/>
											<xs:element name="Employee_Name" type="xs:string" minOccurs="0"/>
											<xs:element name="Query_Item_Id" type="xs:string" minOccurs="0"/>
											<xs:element name="Login_System_Id" type="xs:string" minOccurs="0"/>
											<xs:element name="Query_Content" type="xs:string" minOccurs="0"/>
											<xs:element name="Action_Type" type="xs:string" minOccurs="0"/>
											<xs:element name="Output_Count" type="xs:string" minOccurs="0"/>
											<xs:element name="Output_Device" type="xs:string" minOccurs="0"/>
										</xs:sequence>
									</xs:complexType>
								</xs:element>
							</xs:choice>
						</xs:complexType>
						<xs:unique name="Constraint1" msdata:PrimaryKey="true">
							<xs:selector xpath=".//EMR_Query_Log"/>
							<xs:field xpath="Query_Time"/>
						</xs:unique>
					</xs:element>
				</xs:schema>
				<diffgr:diffgram xmlns:diffgr="urn:schemas-microsoft-com:xml-diffgram-v1" xmlns:msdata="urn:schemas-microsoft-com:xml-msdata">
					<NewDataSet xmlns="">
						<EMR_Query_Log diffgr:id="EMR_Query_Log1" msdata:rowOrder="0" diffgr:hasChanges="inserted">
							<Query_Time></Query_Time>
							<Employee_Code></Employee_Code>
							<Employee_Name></Employee_Name>
							<Query_Item_Id></Query_Item_Id>
							<Login_System_Id>EMR</Login_System_Id>
							<Query_Content></Query_Content>
							<Action_Type></Action_Type>
							<Output_Count></Output_Count>
							<Output_Device></Output_Device>
						</EMR_Query_Log>
					</NewDataSet>
				</diffgr:diffgram>
			</ds>
		</EMRGetExamineReport>
	</s:Body>
</s:Envelope>